{
  "physical_assault": {
    "laws": [
      {
        "act": "Indian Penal Code",
        "section": "323",
        "title": "Voluntarily causing hurt",
        "description": "Whoever, except in the case provided by law, voluntarily causes hurt shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five hundred rupees, or with both."
      },
      {
        "act": "Indian Penal Code",
        "section": "324",
        "title": "Voluntarily causing hurt by means of poison, etc.",
        "description": "Whoever, except in the case provided by law, by means of poison or any harmful substance attempts to cause, or knowing that he is likely thereby to cause, hurt to any person, shall be punished with imprisonment of either description for a term which may extend to six months, or with fine which may extend to five hundred rupees, or with both."
      },
      {
        "act": "Indian Penal Code",
        "section": "325",
        "title": "Voluntarily causing grievous hurt",
        "description": "Whoever, except in the case provided by law, voluntarily causes grievous hurt shall be punished with imprisonment of either description for a term which may extend to seven years, and shall also be liable to fine which may extend to one thousand rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "336",
        "title": "Act endangering life or personal safety",
        "description": "Whoever does any act so rashly or negligently as to endanger human life or the personal safety of others, shall be punished with imprisonment of either description for a term which may extend to three months, or with fine which may extend to two hundred and fifty rupees, or with both."
      },
      {
        "act": "Indian Penal Code",
        "section": "341",
        "title": "Wrongful restraint",
        "description": "Whoever wrongfully restrains any person shall be punished with imprisonment of either description for a term which may extend to one month, or with fine which may extend to two hundred and fifty rupees, or with both."
      },
      {
        "act": "Indian Penal Code",
        "section": "342",
        "title": "Wrongful confinement",
        "description": "Whoever wrongfully confines any person shall be punished with imprisonment of either description for a term which may extend to one year, or with fine which may extend to one thousand rupees, or with both."
      }
    ],
    "filing_procedure": [
      "File First Information Report (FIR) at nearest police station",
      "Provide detailed description of the assault incident",
      "Mention date, time, location, and witnesses present",
      "Get medical examination done immediately (within 24 hours ideally)",
      "Collect medical certificates and photographs of injuries",
      "File complaint before Magistrate if police refuses to file FIR",
      "Preserve evidence (torn clothes, weapons used, etc.)",
      "Get written FIR acknowledgement",
      "Follow up with investigating officer regularly"
    ]
  },
  "sexual_assault": {
    "laws": [
      {
        "act": "Indian Penal Code",
        "section": "375",
        "title": "Rape",
        "description": "A man is said to commit 'rape' if he penetrates his penis into the vagina, mouth, anus or urethra of a woman or makes her do so, by coercion, abuse of authority or when she is incapable of giving consent."
      },
      {
        "act": "Indian Penal Code",
        "section": "376",
        "title": "Punishment for rape",
        "description": "Rigorous imprisonment of not less than 7 years but which may be for life, and also liable to fine and/or death penalty in case of aggravated rape."
      },
      {
        "act": "Indian Penal Code",
        "section": "376A",
        "title": "Rape by husband on wife during separation",
        "description": "When a man commits rape on his wife who is living separate from him, he shall be punished with imprisonment of not less than 2 years."
      },
      {
        "act": "Protection of Children from Sexual Offences Act, 2012",
        "section": "3",
        "title": "Punishment for penetrative sexual assault on a child",
        "description": "For a child below 16 years: Rigorous imprisonment for not less than 7 years and fine up to 1 lakh rupees. For 16-18 years: Rigorous imprisonment for not less than 5 years."
      },
      {
        "act": "Protection of Children from Sexual Offences Act, 2012",
        "section": "5",
        "title": "Punishment for aggravated penetrative sexual assault",
        "description": "Rigorous imprisonment for not less than 10 years or life imprisonment and fine up to 1 lakh rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "228A",
        "title": "Disclosure of identity of victim of rape",
        "description": "No information shall be published in any form which discloses or tends to disclose the identity of a victim of rape."
      }
    ],
    "filing_procedure": [
      "Go to nearest police station or emergency services immediately",
      "Report to female police officer if available (women can request this)",
      "File FIR and get copy within 30 minutes",
      "Do NOT bathe or change clothes before medical examination",
      "Get medical examination at government hospital within 24 hours",
      "Collect detailed medical report documenting injury, semen, DNA",
      "Obtain photographs of all injuries",
      "Provide complete statement to investigating officer",
      "Inform police about any CCTV footage or witnesses",
      "Request police to preserve all physical evidence",
      "Apply for victim compensation under Victim Compensation Scheme",
      "Request counseling support from NGOs",
      "File anticipatory bail application if threatened by accused",
      "Intimate court about threats or pressure to withdraw complaint"
    ]
  },
  "sexual_harassment": {
    "laws": [
      {
        "act": "Indian Penal Code",
        "section": "294",
        "title": "Obscene acts and songs",
        "description": "Outraging modesty through words, sounds, gestures intended to be seen by woman is punishable with imprisonment up to 3 months or fine up to 200 rupees or both."
      },
      {
        "act": "Indian Penal Code",
        "section": "509",
        "title": "Word, gesture or act intended to insult the modesty of a woman",
        "description": "First offence: Imprisonment up to 3 months or fine up to 200 rupees or both. Subsequent offence: Imprisonment up to 6 months or fine up to 500 rupees or both."
      },
      {
        "act": "Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act, 2013",
        "section": "2",
        "title": "Definition of sexual harassment at workplace",
        "description": "Includes unwelcome verbal, non-verbal or physical conduct of sexual nature affecting dignity of woman at work."
      },
      {
        "act": "Protection of Children from Sexual Offences Act, 2012",
        "section": "7",
        "title": "Punishment for sexual harassment of a child",
        "description": "Imprisonment of up to 5 years and fine up to 50,000 rupees for a child below 16, and 3 years and 25,000 rupees for child 16-18 years."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "67",
        "title": "Punishment for publishing obscene material in electronic form",
        "description": "Punishment up to 5 years imprisonment and fine up to 10 lakh rupees."
      }
    ],
    "filing_procedure": [
      "File written complaint with employer/institution",
      "Complaint should contain specific dates, times, and nature of harassment",
      "Request Internal Complaints Committee (ICC) action within 7 days",
      "Simultaneously file police complaint if harassment involves threats",
      "File police FIR under IPC Section 509 or 294",
      "Preserve all evidence: messages, emails, letters, recordings (legal)",
      "Get statements from witnesses in writing",
      "Request police for interim protective order",
      "Apply for restraining order against harasser",
      "Keep copies of all formal communication",
      "Follow up with ICC regularly (max 90 days for resolution)",
      "Appeal to external agency if not satisfied with ICC decision",
      "File complaint with District Commission if institutional response inadequate"
    ]
  },
  "caste_discrimination": {
    "laws": [
      {
        "act": "Constitution of India",
        "section": "Article 17",
        "title": "Abolition of Untouchability",
        "description": "Untouchability is abolished and its practice in any form is forbidden. The enforcement of any disability arising out of untouchability is made a punishable offence."
      },
      {
        "act": "Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act, 1989",
        "section": "3",
        "title": "Punishment for atrocities",
        "description": "Various offences listed including causing hurt, denial of access to water, denial of common passage, desecration of symbols. Punishment ranges from 6 months to 5 years imprisonment."
      },
      {
        "act": "Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act, 1989",
        "section": "3(1)(vi)",
        "title": "Offence of insulting caste",
        "description": "Using words, signs or representations that insult or suggest inferiority because of caste. Punishment: Not less than 6 months and up to 5 years imprisonment, and fine up to 5000 rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "153A",
        "title": "Promoting enmity between different groups on grounds of caste",
        "description": "Punishment up to 3 years imprisonment and fine up to 500 rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "295",
        "title": "Injuring or defiling place of worship",
        "description": "Defiling caste symbols or sacred objects. Punishment up to 2 years imprisonment and fine up to 1000 rupees."
      }
    ],
    "filing_procedure": [
      "Immediately report to police with detailed complaint",
      "Provide evidence: audio/video recordings, photographs, messages",
      "Get statements from all witnesses in writing",
      "Register police complaint under SC/ST Prevention of Atrocities Act",
      "Request police to invoke provisions of Prevention of Atrocities Act (stricter than regular IPC)",
      "File complaint with District Magistrate if police refuses",
      "Approach National Commission for Scheduled Castes (NCSC)",
      "File complaint with Human Rights Commission if institutional response inadequate",
      "Collect medical certificates if physical assault involved",
      "Apply for victim compensation immediately",
      "Request anticipatory bail if threatened with counter-cases",
      "Engage with legal aid organization for representation",
      "Keep media informed to create public awareness (if safe to do so)"
    ]
  },
  "racism": {
    "laws": [
      {
        "act": "Indian Penal Code",
        "section": "153",
        "title": "Wantonly provoking any class by insults, &c.",
        "description": "Acts intended or knowing to provoke breach of peace by insulting a person or class based on race/place of birth. Punishment up to 1 year imprisonment and fine up to 1000 rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "153A",
        "title": "Promoting enmity between different groups on grounds of caste, race",
        "description": "Punishment up to 3 years imprisonment and fine up to 500 rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "295",
        "title": "Injuring or defiling place of worship",
        "description": "If symbols are defiled. Punishment up to 2 years and fine up to 1000 rupees."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66D",
        "title": "Punishment for impersonation using computer resource",
        "description": "If racist content posted using fake identity. Punishment up to 3 years and fine up to 1 lakh rupees."
      }
    ],
    "filing_procedure": [
      "File detailed police complaint with specific racist statements/incidents",
      "Provide evidence: screenshots, messages, videos, recordings",
      "Get witness statements",
      "Request police to register case under IPC Section 153A",
      "For online racism: Report to cyber police cell with URLs/screenshots",
      "File complaint with Human Rights Commission",
      "Contact National Commission for Minorities if applicable",
      "Collect evidence of psychological impact (mental health records)",
      "Apply for restraining order/injunction",
      "Request police protection if threatened",
      "Escalate to senior police officer if local police unresponsive"
    ]
  },
  "ragging": {
    "laws": [
      {
        "act": "Anti-Ragging Act, UGC Regulations",
        "section": "Central Government Prohibition of Ragging Bill, 1998",
        "title": "Definition and prohibition of ragging",
        "description": "Ragging is banned in all educational institutions. Various forms including physical abuse, psychological harassment, sexual abuse, and violations of dignity."
      },
      {
        "act": "Indian Penal Code",
        "section": "336-338",
        "title": "Act endangering life or personal safety",
        "description": "Rash or negligent acts endangering life. Punishment up to 3 months imprisonment and fine up to 250 rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "341-348",
        "title": "Criminal force, wrongful restraint, confinement",
        "description": "Unlawful restraint and confinement. Punishment ranging from 1 month to 1 year."
      },
      {
        "act": "Indian Penal Code",
        "section": "375-376",
        "title": "Rape and sexual assault",
        "description": "If ragging involves sexual abuse. Rigorous imprisonment of 7 years to life."
      },
      {
        "act": "Protection of Children from Sexual Offences Act, 2012",
        "section": "3-7",
        "title": "If ragging involves children",
        "description": "Punishment up to 5-10 years for sexual offences against children."
      }
    ],
    "filing_procedure": [
      "Report immediately to college/institution anti-ragging committee",
      "File written complaint with specific names, dates, and descriptions",
      "Request protection measures before investigation",
      "Simultaneously file police complaint if police intervention needed",
      "File FIR under Anti-Ragging Act provisions",
      "Collect medical certificates if physical injury occurred",
      "Get witness statements from fellow students",
      "Preserve evidence: messages, videos, photographs",
      "Request interim protective measures (relocation, changed schedule)",
      "File complaint with UGC Anti-Ragging Cell (ragging.uchd.ac.in)",
      "Seek legal aid for representation",
      "Request academic safeguards while complaint is pending",
      "Escalate to principal/management if committee is biased",
      "Contact National Human Rights Commission if state authorities unresponsive"
    ]
  },
  "threats": {
    "laws": [
      {
        "act": "Indian Penal Code",
        "section": "503",
        "title": "Criminal intimidation",
        "description": "Whoever intentionally puts any person in fear of any injury commits criminal intimidation. Punishment up to 2 years imprisonment, fine up to 500 rupees, or both."
      },
      {
        "act": "Indian Penal Code",
        "section": "504",
        "title": "Insult with intent to provoke breach of peace",
        "description": "Intentional insult intending to provoke breach of peace. Punishment up to 2 years imprisonment and fine up to 500 rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "506",
        "title": "Criminal intimidation by anonymous communication or rumor",
        "description": "Threatening another with injury. Punishment up to 6 months imprisonment and fine up to 300 rupees (simple intimidation) or up to 2 years and fine up to 1000 rupees (aggravated)."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66C",
        "title": "Identity theft",
        "description": "If threatening through fake accounts. Punishment up to 3 years and fine up to 1 lakh rupees."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "67",
        "title": "Publishing obscene material in electronic form",
        "description": "If threats include obscene content. Punishment up to 5 years and fine up to 10 lakh rupees."
      }
    ],
    "filing_procedure": [
      "Immediately file police complaint with FIR",
      "Provide all threatening communications: messages, emails, calls, letters",
      "Get written statements from witnesses who heard/saw threats",
      "Request police protection (if life is in imminent danger)",
      "Request anticipatory bail if threatened with false cases",
      "Preserve all evidence in original format (do not edit)",
      "File for restraining order/injunction from court",
      "Request recording of phone threats (if made over call)",
      "File cyber complaint if threats made online",
      "Report to social media platform if threats posted publicly",
      "Keep police informed of any escalation",
      "Apply for ex-parte injunction if threat is immediate",
      "Request witness protection order"
    ]
  },
  "cyber_harassment": {
    "laws": [
      {
        "act": "Indian Penal Code",
        "section": "503-506",
        "title": "Criminal intimidation and threats",
        "description": "Online threats and intimidation. Punishment up to 2 years imprisonment and fine up to 500-1000 rupees."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66A",
        "title": "Punishment for sending offensive messages through communication service",
        "description": "Sending grossly offensive or menacing messages with intent to cause annoyance. Punishment up to 3 years imprisonment and fine up to 5 lakh rupees. (Note: Section 66A was partially struck down by SC in 2015)"
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66C",
        "title": "Identity theft",
        "description": "Fraudulently or dishonestly uses electronic signature of another person. Punishment up to 3 years imprisonment and fine up to 1 lakh rupees."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66D",
        "title": "Punishment for impersonation using computer resource",
        "description": "Impersonating through electronic means. Punishment up to 3 years imprisonment and fine up to 1 lakh rupees."
      }
    ],
    "filing_procedure": [
      "File complaint with local police cybercrime cell (can file online on police website)",
      "Provide screenshot/documentation of all harassing messages",
      "Include URL/links and timestamps of posts if on public platform",
      "Provide account details of person sending harassment",
      "Report to social media platform: Facebook, Twitter, Instagram, etc.",
      "Use platform's built-in reporting feature for blocking and escalation",
      "Request police to preserve evidence from ISP/platform",
      "File separate complaints if harassment on multiple platforms",
      "Apply for blocking order: ask platform to block harasser's account",
      "Keep records of all communication with police and platform",
      "Request privacy settings review on personal accounts",
      "Apply for anticipatory bail if threatened with legal action",
      "Seek victim protection in online harassment cases"
    ]
  },
  "cyber_bullying": {
    "laws": [
      {
        "act": "Indian Penal Code",
        "section": "499",
        "title": "Defamation",
        "description": "Making or publishing any imputation concerning any person intending to harm, or knowing or having reason to believe that such imputation will harm, the reputation of such person."
      },
      {
        "act": "Indian Penal Code",
        "section": "503-506",
        "title": "Criminal intimidation and threats",
        "description": "Threats or intimidation causing fear; online threats and harassment may attract punishment under these provisions."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66E",
        "title": "Violation of privacy",
        "description": "Punishment for capturing, publishing or transmitting the image of a private area of any person without his or her consent."
      },
      {
        "act": "Indian Penal Code",
        "section": "509",
        "title": "Word, gesture or act intended to insult the modesty of a woman",
        "description": "Insulting the modesty of a person by words, gestures or acts, which may apply when online messages target a person's dignity."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "67",
        "title": "Publishing or transmitting obscene material in electronic form",
        "description": "Punishment for publishing obscene content online which may be used to shame or harass victims."
      }
    ],
    "filing_procedure": [
      "Collect and preserve screenshots, URLs, timestamps and message headers of abusive content",
      "File complaint with local police cybercrime cell or file online on state police cyber portals",
      "Provide links to social media posts and request takedown from the platform",
      "File FIR under relevant IPC sections (e.g., 499, 503, 506, 509) and IT Act provisions as applicable",
      "Request police to obtain subscriber information and preserve evidence from the platform/ISP",
      "Request interim protection orders or blocking orders against harassers",
      "Report abusive accounts to the social media platform and follow up for escalation",
      "Seek civil remedies for defamation or privacy violations (send notice to platform/accused)",
      "Obtain legal advice for takedown notices and cease-and-desist communications",
      "Keep record of all communications with police and platform; seek victim support services if needed"
    ]
  },
  "institutional_misconduct": {
    "laws": [
      {
        "act": "Constitution of India",
        "section": "Articles 14, 21, 32",
        "title": "Right to equality, personal liberty, constitutional remedies",
        "description": "Right to equal treatment and protection against institutional discrimination. Violations can be challenged in High Court."
      },
      {
        "act": "National Commission for Protection of Child Rights Act, 2005",
        "section": "13",
        "title": "Powers to inquire into violations",
        "description": "NCPCR can inquire into cases of institutional child abuse and misconduct."
      },
      {
        "act": "All India Council for Technical Education (AICTE) Regulations",
        "section": "Regulations on Student Rights",
        "title": "Student protection and grievance redressal",
        "description": "Institutions must follow due process, provide fair investigation, and student representation in disciplinary committees."
      }
    ],
    "filing_procedure": [
      "File formal written complaint with institution's grievance cell",
      "Provide detailed evidence: documents, communications, witness statements",
      "Request written acknowledgement of complaint filing",
      "File Right to Information (RTI) request for institutional policies",
      "Request meeting with ombudsman/grievance officer",
      "Request interim protective measures pending investigation",
      "Escalate to affiliating university if institution is unresponsive",
      "File complaint with state education department",
      "Contact National Commission for Protection of Child Rights (if applicable)",
      "File public interest litigation in High Court if serious violations",
      "Approach media and student organizations for pressure and publicity",
      "Seek legal aid for representation in cases",
      "Document all institutional responses for future legal proceedings"
    ]
  },
  "blackmail_extortion": {
    "laws": [
      {
        "act": "Indian Penal Code",
        "section": "383",
        "title": "Extortion",
        "description": "Putting any person in fear of any injury and thereby dishonestly inducing that person to deliver property. Punishment up to 3 years imprisonment and fine up to 500 rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "384",
        "title": "Punishment for extortion",
        "description": "Rigorous imprisonment of up to 3 years and fine up to 5000 rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "387-389",
        "title": "Dacoity and dacoity with attempt to cause death or grievous hurt",
        "description": "Organized extortion. Punishment up to 10 years imprisonment."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66E",
        "title": "Violation of privacy",
        "description": "Publishing private images without consent. Punishment up to 3 years imprisonment and fine up to 4 lakh rupees."
      }
    ],
    "filing_procedure": [
      "File police complaint immediately with FIR",
      "Provide all blackmail communications: messages, emails, calls",
      "Include demands made and threats given",
      "Report to cyber cell if extortion is online",
      "Request police protection immediately",
      "Do NOT pay any money to extortionist",
      "Preserve all evidence in original format",
      "Request anticipatory bail if threatened with exposure",
      "Apply for restraining order/injunction",
      "Report to social media platforms if threats posted publicly",
      "File separate cyber complaint for privacy violation if applicable",
      "Inform bank if financial extortion involved",
      "Request witness protection if others are also being targeted"
    ]
  },
  "defamation_privacy_fraud": {
    "laws": [
      {
        "act": "Indian Penal Code",
        "section": "499",
        "title": "Defamation",
        "description": "Publishing or speaking false information that harms reputation. Punishment up to 2 years imprisonment, fine up to 5000 rupees, or both."
      },
      {
        "act": "Indian Penal Code",
        "section": "500",
        "title": "Punishment for defamation",
        "description": "Imprisonment up to 6 months and fine up to 500 rupees."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66E",
        "title": "Violation of privacy",
        "description": "Capturing, publishing, or transmitting intimate image without consent. Punishment up to 3 years and fine up to 4 lakh rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "420",
        "title": "Cheating and dishonestly inducing delivery of property",
        "description": "Fraud and deception for obtaining property. Imprisonment up to 7 years and fine up to 1 lakh rupees."
      }
    ],
    "filing_procedure": [
      "File civil defamation suit in District Court",
      "Provide evidence: screenshots, documents, false statements published",
      "Request immediate injunction to stop publishing false information",
      "Simultaneously file police complaint for criminal defamation",
      "Publish correction notice in same medium where defamation occurred",
      "Send cease and desist letter through lawyer",
      "File complaint with social media platforms",
      "Request removal of defamatory content with timeline",
      "Document all harm suffered (professional, personal, financial)",
      "Claim damages in civil suit (actual, special, exemplary)",
      "File cyber complaint if defamation online",
      "Request court order for disclosure of anonymous poster's identity",
      "Apply for temporary injunction ex-parte if urgency"
    ]
  },
  "general_discrimination": {
    "laws": [
      {
        "act": "Constitution of India",
        "section": "Article 14",
        "title": "Right to equality",
        "description": "State shall not deny any person equality before law or equal protection. Violation can be challenged."
      },
      {
        "act": "Constitution of India",
        "section": "Article 15",
        "title": "Prohibition of discrimination on grounds of religion, race, caste, sex, place of birth",
        "description": "State shall not discriminate against citizens on certain grounds. Applicable to educational institutions."
      },
      {
        "act": "Persons with Disabilities Act, 1995",
        "section": "Rights of persons with disabilities",
        "title": "Protection against discrimination based on disability",
        "description": "Institutions must provide reasonable accommodation for persons with disabilities."
      }
    ],
    "filing_procedure": [
      "Document all instances of discrimination with dates and details",
      "File formal complaint with institution/organization",
      "Request written response within stipulated time",
      "File complaint with appropriate commission (SC/ST, Women, Minorities, Disability)",
      "Apply for interim protective measures",
      "File RTI request for relevant policies and practices",
      "Seek legal aid for representation",
      "File public interest litigation if systemic discrimination",
      "Approach media for awareness and pressure",
      "Contact relevant NGOs working on discrimination",
      "Escalate to state-level authorities if institution unresponsive",
      "Document all retaliatory actions taken against complainant"
    ]
  },
  "impersonation_doxxing": {
    "laws": [
      {
        "act": "Information Technology Act, 2000",
        "section": "66C",
        "title": "Identity theft",
        "description": "Whoever fraudulently or dishonestly makes use of the electronic signature, password or any other unique identification feature of any other person, shall be punished with imprisonment of either description for a term which may extend to three years and shall also be liable to fine which may extend to rupees one lakh."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66D",
        "title": "Cheating by personation by using computer resource",
        "description": "Whoever by means of computer resource or communications device cheats by personation, shall be punished with imprisonment of either description for a term which may extend to three years and shall also be liable to fine which may extend to rupees one lakh."
      },
      {
        "act": "Indian Penal Code",
        "section": "499",
        "title": "Defamation",
        "description": "Whoever, by words either spoken or intended to be read, or by signs or by visible representations, makes or publishes any imputation concerning any person intending to harm his reputation or knowing it to be likely to harm his reputation, commits defamation."
      },
      {
        "act": "Indian Penal Code",
        "section": "500",
        "title": "Punishment for defamation",
        "description": "Whoever defames another shall be punished with simple imprisonment for a term which may extend to two years, or with fine which may extend to five hundred rupees, or with both."
      },
      {
        "act": "Indian Penal Code",
        "section": "406",
        "title": "Punishment for criminal breach of trust",
        "description": "Whoever, being in any manner entrusted with property, or with any dominion over property in his capacity of a public servant or by virtue of any law for the time being in force, commits criminal breach of trust in respect of that property, shall be punished with imprisonment of either description for a term which may extend to seven years, or with fine."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "67",
        "title": "Punishment for publishing obscene material in electronic form",
        "description": "Applies if personal images are shared without consent along with impersonation."
      }
    ],
    "filing_procedure": [
      "Screenshot and document fake profile/account with all posts and comments",
      "Report fake account to social media platform immediately with evidence",
      "Request platform to remove profile and block impersonator",
      "File police complaint under IT Act 66C/66D at cyber crime cell",
      "Provide all screenshots, profile links, and evidence of impersonation",
      "Get case reference number from police",
      "File defamation case in civil court if reputation damaged",
      "Send legal notice to impersonator demanding removal of fake profile",
      "Request platform to disclose IP address and user information to police",
      "Monitor for continued impersonation activity",
      "Claim damages in civil court for mental harassment and reputation loss",
      "Register complaint on National Cyber Crime Reporting Portal (cybercrime.gov.in)"
    ]
  },
  "cyber_sexual_crime": {
    "laws": [
      {
        "act": "Protection of Children from Sexual Offences Act, 2012",
        "section": "Section 13, 14, 15",
        "title": "Punishment for producing, distributing, or transmitting child sexual abuse material",
        "description": "Criminal offense with imprisonment up to 5 years for online sexual abuse of minors."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66E",
        "title": "Punishment for violation of privacy",
        "description": "Whoever intentionally or knowingly captures, publishes or transmits the private area of any person without his/her consent shall be punished with imprisonment of either description for a term which may extend to three years or with fine which may extend to rupees two lakh, or with both."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "67",
        "title": "Punishment for publishing obscene material in electronic form",
        "description": "Whoever publishes or transmits obscene material in electronic form shall be punished with imprisonment which may extend to five years and fine which may extend to ten lakh rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "354A",
        "title": "Sexual harassment",
        "description": "Physical contact, advances, demand or request for sexual favors, showing pornography, making sexually colored remarks."
      },
      {
        "act": "Indian Penal Code",
        "section": "354D",
        "title": "Stalking",
        "description": "Follows a woman and contacts in any form with intent to harm her privacy, causes alarm."
      },
      {
        "act": "Indian Penal Code",
        "section": "376",
        "title": "Punishment for rape",
        "description": "Includes online sexual assault and coercion through cyber medium."
      }
    ],
    "filing_procedure": [
      "Document all evidence - screenshots, messages, video links, profile names",
      "Stop all communication with perpetrator immediately",
      "Do not forward or share the material with anyone",
      "Report to the online platform immediately",
      "File complaint with Cyber Crime Cell / Police",
      "Provide all evidence including IP addresses and device information",
      "If minor involved, inform parents/guardians immediately",
      "Request urgency in case of minor victim",
      "Contact NCMEC (National Center for Missing & Exploited Children) equivalent",
      "File on cyber crime portal (cybercrime.gov.in)",
      "Keep emotional support person available",
      "Seek counseling from trained professionals"
    ]
  },
  "online_hate_speech": {
    "laws": [
      {
        "act": "Indian Penal Code",
        "section": "153",
        "title": "Wantonly provoking or insulting intended to cause breach of peace",
        "description": "Punishment for promoting enmity between different groups on grounds of religion, race, caste, etc."
      },
      {
        "act": "Indian Penal Code",
        "section": "153A",
        "title": "Promoting enmity between different groups on grounds of religion, race, place of birth, residence, language, etc.",
        "description": "Imprisonment up to 3 years and fine up to 2,000 rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "295",
        "title": "Injuring or defiling place of worship with intent to insult religion",
        "description": "Punishment for contempt of religion through online posts."
      },
      {
        "act": "Indian Penal Code",
        "section": "298",
        "title": "Uttering words with deliberate intent to wound religious feelings",
        "description": "Simple imprisonment up to 6 months or fine up to 250 rupees."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66A",
        "title": "Punishment for sending offensive message through communication device",
        "description": "Imprisonment up to 3 years and fine up to 5 lakh rupees (Note: largely struck down but sections 153 IPC applicable)."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "67",
        "title": "Punishment for publishing obscene material in electronic form",
        "description": "If hate speech contains obscene content."
      }
    ],
    "filing_procedure": [
      "Screenshot the hate speech post/video with timestamp and user details",
      "Note the platform (Twitter, Facebook, YouTube, Instagram, etc.)",
      "Report to platform's abuse/hate speech reporting mechanism",
      "Request urgent removal citing harm caused",
      "File complaint with local cyber crime cell",
      "File complaint with National Cyber Crime Reporting Portal",
      "Include evidence of impact on targeted group or individual",
      "File FIR under IPC sections 153/153A/295/298 as applicable",
      "Provide account information of person posting hate speech",
      "Request legal action against account creator",
      "Contact civil rights organizations for support",
      "Approach media if widespread hate campaign"
    ]
  },
  "stalking": {
    "laws": [
      {
        "act": "Indian Penal Code",
        "section": "354D",
        "title": "Stalking",
        "description": "Follows a woman, attempts to contact without consent, monitoring through electronic surveillance, internet communication with intent to harm her privacy or cause alarm - punishable with imprisonment up to 3 years or fine up to 10,000 rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "498A",
        "title": "Cruelty by husband or his relatives",
        "description": "If stalking is by spouse or relative with intent to cause harm."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "67",
        "title": "Publishing material with intent to harass",
        "description": "If stalking involves online harassment through obscene or threatening messages."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66D",
        "title": "Cheating by personation by using computer resource",
        "description": "If stalker creates fake profiles to track victim."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66E",
        "title": "Punishment for violation of privacy",
        "description": "If stalker captures or transmits victim's private activities."
      },
      {
        "act": "Indian Penal Code",
        "section": "504",
        "title": "Intentional insult with knowledge that will provoke breach of peace",
        "description": "If stalking involves threatening messages."
      }
    ],
    "filing_procedure": [
      "Document all instances of stalking with date, time, location, witnesses",
      "Keep records of all communication attempts (messages, calls, visits)",
      "File police complaint immediately with all evidence",
      "Request for action under IPC 354D for stalking",
      "Provide phone records and social media messages as evidence",
      "If online stalking, report to cyber crime cell",
      "Apply for protective order or restraining order from court",
      "Get anticipatory bail if threatened with arrest",
      "Register complaint on cyber crime portal if online harassment",
      "Contact domestic violence cell if perpetrator is known person",
      "Seek interim protection measures from police",
      "File civil case for damages if needed"
    ]
  },
  "gender_discrimination": {
    "laws": [
      {
        "act": "Constitution of India",
        "section": "Article 14",
        "title": "Right to equality",
        "description": "Equal protection under law regardless of gender."
      },
      {
        "act": "Constitution of India",
        "section": "Article 15",
        "title": "Prohibition of discrimination on grounds of sex",
        "description": "State shall not discriminate on grounds of sex."
      },
      {
        "act": "Equal Remuneration Act, 1976",
        "section": "Sections 2-5",
        "title": "Equal pay for equal work",
        "description": "Employers cannot discriminate in wages based on sex for same work."
      },
      {
        "act": "Maternity Benefit Act, 1961",
        "section": "Protection of maternity",
        "title": "Protection during pregnancy and child birth",
        "description": "Employees cannot be dismissed or demoted on grounds of pregnancy."
      },
      {
        "act": "Sexual Harassment of Women at Workplace (Prevention, Prohibition and Redressal) Act, 2013",
        "section": "Comprehensive coverage",
        "title": "Prevention of sexual harassment at workplace",
        "description": "Creates mechanism for prevention, prohibition and redressal of sexual harassment of women at workplace."
      }
    ],
    "filing_procedure": [
      "Document instances of gender discrimination with dates, witnesses, impact",
      "Approach internal complaints committee (ICC) if in workplace/college",
      "File formal written complaint with HR or administration",
      "Request written acknowledgement of complaint filing",
      "Request time-bound investigation",
      "File complaint with District Commission for Women if no action",
      "Approach State Women's Commission for support",
      "File case under Equal Remuneration Act if wage discrimination",
      "Seek legal representation from women's legal aid",
      "File RTI for relevant policies and past complaints",
      "Contact women's rights organizations for support",
      "Approach higher authorities if institution unresponsive"
    ]
  },
  "religious_discrimination": {
    "laws": [
      {
        "act": "Constitution of India",
        "section": "Article 15",
        "title": "Prohibition of discrimination on grounds of religion",
        "description": "State shall not discriminate against citizens on grounds of religion."
      },
      {
        "act": "Constitution of India",
        "section": "Article 25-28",
        "title": "Right to freedom of religion",
        "description": "Every person has right to freely profess, practice and propagate religion."
      },
      {
        "act": "Indian Penal Code",
        "section": "295",
        "title": "Injuring or defiling place of worship with intent to insult religion",
        "description": "Punishment for desecrating religious sites."
      },
      {
        "act": "Indian Penal Code",
        "section": "295A",
        "title": "Deliberate and malicious acts intended to outrage religious feelings",
        "description": "Imprisonment up to 3 years and fine up to 2,000 rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "298",
        "title": "Uttering words with deliberate intent to wound religious feelings",
        "description": "Simple imprisonment or fine for religious insults."
      }
    ],
    "filing_procedure": [
      "Document instances of religious discrimination with specific dates and details",
      "Gather evidence of discriminatory behavior or statements",
      "File complaint with institution/organization administration",
      "Request written response within specific timeframe",
      "File complaint with District Commission for Minorities",
      "Approach State Minorities Commission if needed",
      "File police complaint if violence or threat involved",
      "Request protection against retaliation",
      "Seek support from religious/community organizations",
      "File RTI for institutional policies on minority rights",
      "Contact legal aid organization for representation",
      "File civil case if reputation or property damaged"
    ]
  },
  "administrative_violation": {
    "laws": [
      {
        "act": "Right to Information Act, 2005",
        "section": "RTI provisions",
        "title": "Right to access information from public authorities",
        "description": "Citizens have right to information from government institutions."
      },
      {
        "act": "Constitution of India",
        "section": "Article 226",
        "title": "Writ of Mandamus",
        "description": "High Court can issue mandamus to compel public officials to perform duties."
      },
      {
        "act": "Constitution of India",
        "section": "Article 32",
        "title": "Constitutional remedy for violation of rights",
        "description": "Citizens can approach Supreme Court for enforcement of fundamental rights."
      },
      {
        "act": "Protection of Human Rights Act, 1993",
        "section": "Complaint mechanism",
        "title": "Right to file complaint against violation of human rights",
        "description": "Human Rights Commission can investigate violation of rights by public officials."
      },
      {
        "act": "Indian Penal Code",
        "section": "166",
        "title": "Public servant disobeying law with intent to cause injury",
        "description": "Punishment for government employee acting in violation of legal obligations."
      }
    ],
    "filing_procedure": [
      "Gather all relevant documents and records",
      "Request written explanation from institution for action taken",
      "File formal written complaint with institution head",
      "Keep copy of complaint for records",
      "File RTI application for relevant policies and procedures",
      "File complaint with ombudsman or public grievance cell if applicable",
      "Approach Human Rights Commission with evidence",
      "File writ petition in High Court if fundamental rights violated",
      "Seek legal aid from government legal services authority",
      "Contact relevant regulatory body (UGC for colleges, etc.)",
      "Approach media for public awareness if issue is serious",
      "Document all steps taken for legal proceedings"
    ]
  },
  "verbal_abuse": {
    "laws": [
      {
        "act": "Indian Penal Code",
        "section": "504",
        "title": "Intentional insult with knowledge that will provoke breach of peace",
        "description": "Punishment with simple imprisonment up to two months or fine up to 250 rupees."
      },
      {
        "act": "Indian Penal Code",
        "section": "505",
        "title": "Statements conducing to public mischief",
        "description": "Making or publishing statement known to be false with intent to cause public alarm."
      },
      {
        "act": "Indian Penal Code",
        "section": "499",
        "title": "Defamation",
        "description": "Making false statements that harm reputation."
      },
      {
        "act": "Indian Penal Code",
        "section": "509",
        "title": "Word, gesture or act intended to insult the modesty of a woman",
        "description": "If verbal abuse has sexual connotation or directed at woman, imprisonment up to 3 years."
      },
      {
        "act": "Information Technology Act, 2000",
        "section": "66A",
        "title": "Sending offensive message through communication device",
        "description": "If verbal abuse through online medium (Note: largely struck down)."
      },
      {
        "act": "Indian Penal Code",
        "section": "294",
        "title": "Obscene acts and songs",
        "description": "For using obscene language in public place."
      }
    ],
    "filing_procedure": [
      "Document exact words used and context of verbal abuse",
      "Note date, time, location, and witnesses present",
      "Preserve any written records (messages, emails, posts)",
      "File police complaint immediately with full details",
      "Provide list of potential witnesses who heard the abuse",
      "If online abuse, report to platform and cyber crime cell",
      "Request FIR under IPC 504/505/509 as applicable",
      "Keep medical certificate if verbal abuse caused mental trauma",
      "File defamation case if false accusations made",
      "Seek restraining order from court if ongoing threats",
      "Contact domestic violence cell if abuser is known person",
      "Approach legal aid for representation in proceedings"
    ]
  }
}
